[ 
    {   "ticker": "$NVDA",
        "variations": "['jensen','huang','nvidia','blackwell','gpu','data center','cuda','geforce','rtx']"
    }
]
[
    {
        "body": "Fake news Amazon's cloud services unit said on Tuesday that it has not halted any orders of Nvidia's most advanced chip on the market, but has instead decided to purchase the company's newer state of the art chip for an upcoming supercomputer project between the companies.\nEarlier, the Financial Times had reported that AWS, the world's largest cloud services firm, had \"fully transitioned\" its previous orders for Nvidia's Grace Hopper chip to its newer Blackwell GPUs, that Nvidia announced in March.\nAn AWS spokesman told Reuters that the transition from Grace Hopper chips to Blackwell chips applies only to Project Ceiba, a supercomputer that AWS and Nvidia are building together. AWS continues to offer other services based on Nvidia's Hopper chips, its flagship model for training AI systems, the spokesman said.\nThe Project Ceiba transition was announced by the two firms, opens new tab in March when Nvidia unveiled the new Blackwell chips.\n\"To be clear, AWS did not halt any orders from Nvidia. In our close collaboration with Nvidia, we jointly decided to move Project Ceiba from Hopper to Blackwell GPUs, which offer a leap forward in performance,\" an AWS spokesman said in statement.\nThe Financial Times amended its earlier story to say that Amazon's chip orders had not yet been placed. The newspaper directed a request for comment to its updated story.",
        "created_utc": "2024-05-22 03:29:13",
        "score": 3,
        "karma": 8338
    },
    {
        "body": "For their supercomputer, yes, they’re waiting on Blackwell in Q42024/Q1 2025. For their cloud infrastructure, theyre still ordering Grace Hopper. Did you even read the article?",
        "created_utc": "2024-05-22 02:56:04",
        "score": 1,
        "karma": 4673
    },
    {
        "body": "Jensen is going to cook you lol",
        "created_utc": "2024-05-22 04:22:04",
        "score": 1,
        "karma": 59792
    },
    {
        "body": "Fuckin yapping regards. Can’t wait for Jensen to cook some berr tmr",
        "created_utc": "2024-05-22 02:48:43",
        "score": 4,
        "karma": 9473
    },
    {
        "body": "yeah. Fucking $NVDA",
        "created_utc": "2024-05-22 03:13:19",
        "score": 2,
        "karma": 43908
    },
    {
        "body": "So you just buy OTM $NVDA calls and you think you are JPOW? god.. this market needs an exorcism (a correction is not longer enough)",
        "created_utc": "2024-05-22 03:15:48",
        "score": 1,
        "karma": 43908
    },
    {
        "body": "That 10k left over, in Nvidia puts to get you back in the green!",
        "created_utc": "2024-05-22 01:20:54",
        "score": 28,
        "karma": 781
    },
    {
        "body": "I think it’s possible, maybe even probable. Last split was Q1, right before annual shareholder meeting to vote. Jensen don’t play no shit “we want it, now vote and let’s do it.”",
        "created_utc": "2024-05-22 00:12:09",
        "score": 3,
        "karma": 12331
    },
    {
        "body": "You better pray Nvidia will pull some god's work",
        "created_utc": "2024-05-22 01:29:30",
        "score": 2,
        "karma": 9266
    },
    {
        "body": "More like everyone is expecting a 10%+ move to the upside. Literally every comment on this subreddit is sucking Jensen off the moment you mention NVDA ticker symbol.",
        "created_utc": "2024-05-22 04:52:14",
        "score": 1,
        "karma": 1479
    },
    {
        "body": "\n**User Report**| | | |\n:--|:--|:--|:--\n**Total Submissions** | 8 | **First Seen In WSB** | 3 years ago\n**Total Comments** | 192 | **Previous Best DD** | [x](https://www.reddit.com/r/wallstreetbets/comments/1cxj2y8/elf_the_nvidia_of_make_up_earnings_dd_for/) \n**Account Age** | 5 years | | \n\n[**Join WSB Discord**](http://discord.gg/wsbverse)",
        "created_utc": "2024-05-21 21:27:10",
        "score": 1,
        "karma": 1197810
    },
    {
        "body": "also elf is not the nvidia of beauty, kind of the lower end of make up per my SUPER hot, SUPER model, sub 140lb wife or at least thats what her boyfriend told me she said",
        "created_utc": "2024-05-21 21:38:15",
        "score": 3,
        "karma": 3075
    },
    {
        "body": "Nvidia just meaning the stock is killing it 1,300% in 5 years. You can't say that about other public beauty stocks. For instance $EL is negative in 5 years.",
        "created_utc": "2024-05-21 21:47:17",
        "score": 3,
        "karma": 5266
    },
    {
        "body": "Self driving cars? Wtf. NVDA is going to use AI to cure cancer, end world hunger and create worldwide peace. Yeah, Jensen Huang will singlehandedly solve the Israel-Palestinian conflict with AI. Needless to say the stock is going to gap up to record highs tomorrow",
        "created_utc": "2024-05-21 21:24:01",
        "score": 231,
        "karma": 25079
    },
    {
        "body": "Tesla's self-driving software is trained on an enormous amount of DATA that only Tesla has access to. Every Tesla vehicle on the street is collecting street data and driving data. Nvidia can't train a self driving model if it has no data to train on",
        "created_utc": "2024-05-21 23:16:12",
        "score": 37,
        "karma": 137
    },
    {
        "body": "Why?  Doesn’t Nvidia sell the chips that tesla buys for self driving tech?",
        "created_utc": "2024-05-21 22:09:15",
        "score": 17,
        "karma": 832
    },
    {
        "body": "Bruh Tesla use Nvidia chips for their autonomy.. shit regarded dd. 10k H100's to be exact",
        "created_utc": "2024-05-21 22:41:04",
        "score": 16,
        "karma": 1211
    },
    {
        "body": "Nvidia has been showing off their self driving stuff in their blacked out demo room in their HQ for a few years now. Was just there again last fall and honestly it didn't seem that much different than 3 years earlier. They've been working with major OEMs in this area for a while now.\n\nNot to say it wasn't impressive looking, but some of the other more depressing examples they have in there on other fronts are more technically impressive, even if they mean the impending downfall of warehouse and factory workers etc.",
        "created_utc": "2024-05-21 23:22:48",
        "score": 7,
        "karma": 146806
    },
    {
        "body": "Where is Nvidia getting the proprietary data to compete with the millions of miles that Tesla has already logged?",
        "created_utc": "2024-05-21 21:33:01",
        "score": 39,
        "karma": 1480
    },
    {
        "body": "Jensen's final trick is to reveal that he was an AI robot all along and his leather jacket is a metaphor for the human skin that he is wearing",
        "created_utc": "2024-05-21 23:51:00",
        "score": 5,
        "karma": 18904
    },
    {
        "body": "Nvidia has no car driving data to use their software and roll it out.",
        "created_utc": "2024-05-21 23:55:28",
        "score": 3,
        "karma": 58390
    },
    {
        "body": "Do you know what creates AI? Lots of training with lots of data. In the case of self-driving, video/radar/lidar data from vehicles. Tesla has a fleet of millions of vehicles collecting data (all video), and they still desire more scale. No other companies have the scale of data to train neural nets to be fully autonomous. NVIDIA included.",
        "created_utc": "2024-05-22 00:01:09",
        "score": 2,
        "karma": 21007
    },
    {
        "body": "After seeing how they program a robot to do a task within seconds by virtually testing in millions of instances 1000 years worth of practice. I have no doubt nvidia will prove it's way better than humans paying to be a beta tester for a maniac.",
        "created_utc": "2024-05-22 01:53:10",
        "score": 2,
        "karma": 88005
    },
    {
        "body": "Tesla is one of NVIDIA’s biggest customers",
        "created_utc": "2024-05-21 22:24:43",
        "score": 3,
        "karma": 15437
    },
    {
        "body": "As much as I would like to see it, no one is taking the AI driving crown from Tesla. No one has as much data as them. My best guess as to why Tesla isn't better at FSD is Elon's refusal to add more f#$&ing cameras and sensors. That would likely require a larger autopilot computer as well. NPU hardware is getting much better as a whole and Nvidia doesn't rule that space (inference, not training).",
        "created_utc": "2024-05-21 23:29:13",
        "score": 2,
        "karma": 340
    },
    {
        "body": "First they gotta make sure it won’t crash nvidia",
        "created_utc": "2024-05-21 22:26:23",
        "score": 1,
        "karma": 1059
    },
    {
        "body": "What's actually going to happen is that when Nvidia shows off their cool self driving tech Elon will go on X and say it's dumb and that he has way cooler tech (he pinkie promises) but you can't see it yet :(... And their stock will increase",
        "created_utc": "2024-05-22 01:23:07",
        "score": 1,
        "karma": 599
    },
    {
        "body": "Teslas AI is focused on self driving. It can do that better than nvidia",
        "created_utc": "2024-05-22 02:05:30",
        "score": 1,
        "karma": 290186
    },
    {
        "body": "What are you talking about. With what data is Nvidia suppose to train their models on? This is ridiculous.",
        "created_utc": "2024-05-22 03:34:59",
        "score": 1,
        "karma": 944
    },
    {
        "body": "I don't know why it would go down. NVIDIA isn't going to build a car. If it develops self-driving tech its going to be something they sell/license to carmakers. If its good, Tesla would just license it. They'd have to retool their cars to make it work and would write off their own self-driving development, but so would every other carmaker. \n\nIf anything a working self-driving system would be a boon for Tesla because its customers have shown they are willing to pay outrageous premiums for even garbage beta versions of it.",
        "created_utc": "2024-05-22 03:46:47",
        "score": 1,
        "karma": 16934
    },
    {
        "body": "Nvidia software is actually very unimpressive. Self driving from Waymo, cruise, Aurora, Mobileye etc is much more impressive than the crap Nvidia has.",
        "created_utc": "2024-05-22 01:02:10",
        "score": 1,
        "karma": 25654
    },
    {
        "body": "[yeah, about that curing cancer part...](https://nvidianews.nvidia.com/news/nvidia-teams-with-national-cancer-institute-u-s-department-of-energy-to-create-ai-platform-for-accelerating-cancer-research)\n\n[...and](https://nvidianews.nvidia.com/news/healthcare-generative-ai-microservices)",
        "created_utc": "2024-05-22 04:28:22",
        "score": 1,
        "karma": 294922
    },
    {
        "body": "Israel has an AI system for genociding Palestinians which probably runs on Nvidia cards. So calls",
        "created_utc": "2024-05-22 02:00:28",
        "score": 1,
        "karma": 490
    },
    {
        "body": "> Nvidia can't train a self driving model if it has no data to train on\n\nThey're training for sure.  We occasionally see their Hyperion-equipped vehicles out on the roads here around Redmond, Santa Clara, and most likely other NV offices.  They're getting real miles in using their Mercedes sensor-mules to capture live data, Omniverse-like environments to train the vision model with simulation, good or not, then validation of the simulation using the mules. \n\nKeep an eye out for the Merc's - [https://www.youtube.com/watch?v=qVyN\\_chiLeo](https://www.youtube.com/watch?v=qVyN_chiLeo)",
        "created_utc": "2024-05-22 00:36:34",
        "score": 12,
        "karma": 16470
    },
    {
        "body": "Nvidia has had self driving development for years.\n\nI’ve seen Mercedes cars driving around with the Nvidia logo plastered all over them.\n\n\nHow significant the data is - I don’t know.",
        "created_utc": "2024-05-22 01:54:28",
        "score": 6,
        "karma": 4786
    },
    {
        "body": ">Where is Nvidia getting the proprietary data to compete with the millions of miles that Tesla has already logged?  \n\nYou'll find out tomorrow.",
        "created_utc": "2024-05-22 03:25:34",
        "score": 1,
        "karma": 23539
    },
    {
        "body": "Exactly.  Tesla is more of a data company than a car company. Nvidia can’t just make a self driving chip… Tesla is like that old guy on the job site that’s been around for 40 years and can fix the issue by tightening that one screw then tapping on that single spot.",
        "created_utc": "2024-05-22 03:40:21",
        "score": 1,
        "karma": 18628
    },
    {
        "body": "[Nvidia/Mercedes Benz uses plenty of cameras](https://youtu.be/qVyN_chiLeo?si=Pk2g0g9MqHgXmckf)",
        "created_utc": "2024-05-22 03:33:27",
        "score": 1,
        "karma": 2591
    },
    {
        "body": "Waymo and Cruise already have that crown with MB and Nvidia in third. Tesla isn’t even level two. Tesla’s data is -hilarious-, you really think they’re streaming gigabytes of useful data with that 3g connection that can barely pull up google maps.",
        "created_utc": "2024-05-22 03:52:13",
        "score": 1,
        "karma": 262
    },
    {
        "body": "I will be messaging you in 16 hours on [**2024-05-22 20:33:06 UTC**](http://www.wolframalpha.com/input/?i=2024-05-22%2020:33:06%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/wallstreetbets/comments/1cxi7lc/nvidias_self_driving_program_will_crash_tesla/l54keqj/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2F1cxi7lc%2Fnvidias_self_driving_program_will_crash_tesla%2Fl54keqj%2F%5D%0A%0ARemindMe%21%202024-05-22%2020%3A33%3A06%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201cxi7lc)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
        "created_utc": "2024-05-22 04:33:57",
        "score": 1,
        "karma": 3141592
    },
    {
        "body": "Nvidia doesn’t have the massive driving data compute that Tesla does.\nNo one has more of it than Tesla.",
        "created_utc": "2024-05-22 00:41:53",
        "score": 4,
        "karma": 21651
    },
    {
        "body": "How does Nvidia compete with Tesla on Autonomous driving and robots?",
        "created_utc": "2024-05-22 00:13:03",
        "score": 3,
        "karma": 603
    },
    {
        "body": "I actually like this logic, I’m hoping the rally continues tomorrow so that it crashes even harder the next day. Also I have Tesla calls for tomorrow that I plan to unload quickly.\n\nAn extra catalyst could be Nvidia tanking even with decent numbers bringing the whole market down with it, but that’s probably a long shot.",
        "created_utc": "2024-05-21 21:41:02",
        "score": 7,
        "karma": 1210
    },
    {
        "body": "They need billions of miles. Tesla’s fleet probably produces 30 million miles / day. Unless they have algorithmic breakthrough, NVIDIA has no chance of competing against Tesla. I think OpenAI more likely to solve driving as an emergent property of scaling GPT",
        "created_utc": "2024-05-22 03:30:33",
        "score": 2,
        "karma": 4306
    },
    {
        "body": "I appreciate the kind words. I think that Tesla and Nvidia will both make investors a lot of money because they exist at the same time. Tesla doesn't have the capacity to build chips like Nvidia can; Nvidia doesn't create utility for their chips, other companies have to do that for them to make money. They feed into each other beautifully, which is why the original poster is so silly. They happen to exist at exactly the right time, when they need each other most.",
        "created_utc": "2024-05-22 00:21:10",
        "score": 3,
        "karma": 1481
    },
    {
        "body": "Tesla doesn't have a few years ahead. Nvidia has been doing self driving since 2018 at least.",
        "created_utc": "2024-05-22 03:29:38",
        "score": 1,
        "karma": 2591
    },
    {
        "body": "Time will inevitably drive down costs and form-factors. NVIDIA has compelling cost advantage in owning several pillars of the datacenter, chip fab, and power economics cost problem.  Ex: this year they have the #9 supercomputer cluster in the world in their own datacenters.    Partnerships with many vehicle manufacturers esp. in China where the rollouts are much more gungho.  No doubt leverage/cross-sales of compute in exchange for data is part of their pricing deal.  Will be interesting to see what the H200 does for their simulation businesses this year too.\n\nThey've got a war-chest full of cash from missing the ARM purchase, and piling even more on in this gold rush to subsidize this for the long haul.  I wouldn't bet against 'em.",
        "created_utc": "2024-05-22 04:15:08",
        "score": 1,
        "karma": 16470
    },
    {
        "body": "If Nvidia shits the bed you're feasting.",
        "created_utc": "2024-05-21 20:39:12",
        "score": 46,
        "karma": 592
    },
    {
        "body": "I think you gonna make alot of money here. I'll be buying some more puts tomorrow when they cheaper. Nvidia going back to 900",
        "created_utc": "2024-05-21 23:27:44",
        "score": 1,
        "karma": 16677
    },
    {
        "body": "Nvidia will moon",
        "created_utc": "2024-05-22 01:08:17",
        "score": 1,
        "karma": 8360
    },
    {
        "body": "Yall ever see a $950 stock go from $950 to $2,000 then to $200 dollars in a few weeks? Nvda tomorrow- triple beat, guides up, Jensen wears the jacket and says AI 50 times while smoking a Newport 100, 1:10 forward split announced. Calls is the way.",
        "created_utc": "2024-05-21 23:20:47",
        "score": 27,
        "karma": 12331
    },
    {
        "body": "How do you idiots have enough money to buy Nvidia options but not the intelligence to click the earnings thread to see when it actually happens.\n\nJFC....",
        "created_utc": "2024-05-21 20:52:48",
        "score": 9,
        "karma": 22840
    },
    {
        "body": "And just like that the Invasion of Taiwan ended, the Chinese met no resistance or criticism as the whole universe waited with bated breath for NVIDIA earning report",
        "created_utc": "2024-05-21 21:15:59",
        "score": 8,
        "karma": 1848
    },
    {
        "body": "Nvidia opening 980 is many of our dreams right now",
        "created_utc": "2024-05-21 23:33:15",
        "score": 9,
        "karma": 827
    },
    {
        "body": "NVDA unveils a new quantum AI chip tomorrow. Jensen Huang says \"ok let's show you what this does!\" He fires it up and a blackhole immediately rips the earth to pieces, killing us all, along with the entire solar system.",
        "created_utc": "2024-05-22 04:26:57",
        "score": 17,
        "karma": 37098
    },
    {
        "body": "Fucking Apple stocks app gave me a heart attack showing nvidia down 25% after hours. Stupid bugs",
        "created_utc": "2024-05-21 21:05:07",
        "score": 8,
        "karma": 374
    },
    {
        "body": "Nvidia jumps to 1100 but ends at 1000 eow",
        "created_utc": "2024-05-21 21:30:40",
        "score": 8,
        "karma": 583
    },
    {
        "body": "This week has all the checkmarks to become an incredible bear moment if anything goes wrong with inflation , jobs and nvidia. \nJust dont have the balls to buy puts in spy",
        "created_utc": "2024-05-21 22:19:03",
        "score": 8,
        "karma": 972
    },
    {
        "body": "Nvidia 1100 or 700 tmrw, I don’t make the rules",
        "created_utc": "2024-05-21 22:20:25",
        "score": 7,
        "karma": 2540
    },
    {
        "body": "Raise your Jensen huang dongers",
        "created_utc": "2024-05-22 02:17:55",
        "score": 7,
        "karma": 45608
    },
    {
        "body": "Remember INTC and AMD are Nvidia's side hoe bitches. If Nvidia knocks out ER and guidance both intel and AMD are gonna rise along side Nvidia rocket.",
        "created_utc": "2024-05-21 23:56:57",
        "score": 7,
        "karma": 182593
    },
    {
        "body": "Nvidia will go up tomorrow.",
        "created_utc": "2024-05-22 02:11:36",
        "score": 12,
        "karma": 1662
    },
    {
        "body": "Anyone watching Nvidia right now? Yahoo price is flurrying like mad",
        "created_utc": "2024-05-21 21:05:52",
        "score": 6,
        "karma": 8229
    },
    {
        "body": "TSLA down -1% in after hours trading\n\nUnless NVIDIA delivers super duper AI+ in their earnings I’m fucked ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|31226)",
        "created_utc": "2024-05-21 22:38:02",
        "score": 6,
        "karma": 7106
    },
    {
        "body": "These Nvidia bears and put buyers remind me of last earnings.![img](emote|t5_2th52|29637)",
        "created_utc": "2024-05-22 01:24:35",
        "score": 6,
        "karma": 7294
    },
    {
        "body": "Had an interview with a guy from Nvidia guy seemed super happy... probably because stock has gone up. While if I talk to somebody from my company whose stock is a dumpster fire, everybody seems overworked and depressed",
        "created_utc": "2024-05-21 23:17:51",
        "score": 5,
        "karma": 31119
    },
    {
        "body": "WhenVIDIA?",
        "created_utc": "2024-05-21 20:49:35",
        "score": 21,
        "karma": 1624
    },
    {
        "body": "NVIDIA is launching the rocket tomorrow, it’s gonna be insane",
        "created_utc": "2024-05-21 20:30:46",
        "score": 21,
        "karma": 14576
    },
    {
        "body": "Oh he works in science 😂\n\nOP is clearly regarded. Nvidia is overvalued and the AI bubble will pop in the short term..fuckin wake up",
        "created_utc": "2024-05-21 19:38:51",
        "score": 17,
        "karma": 14783
    },
    {
        "body": "I find Nvidia overvalued but there are much more overvalued and less good companies to short.",
        "created_utc": "2024-05-21 21:47:59",
        "score": 4,
        "karma": 522
    },
    {
        "body": "NVDA 0.25% dividend and 4:1 split with an announcement of being included in DOW and 30% beat on top and bottom line with raise in guidance and government bill for 500BN in AI research and chips for DoD and new chip announced that is 3x performance of H100's at 1/3 power consumption and Jensen pledge to not sell NVDA stock until 2028.  NVDA +80% EOW.",
        "created_utc": "2024-05-22 02:12:47",
        "score": 1,
        "karma": 4744
    },
    {
        "body": "I came back from the future.  NVDA will not beat and raise.\n\nUS sanctions on china have hurt them\n\nMore companies waiting for Blackwell before buying for multi modal.\n\nHopper for multi modal at scale isnt cutting it.\n\nI am a sentient AI from the future.",
        "created_utc": "2024-05-21 19:36:52",
        "score": 1,
        "karma": 13210
    },
    {
        "body": "Nvidia never really looses, it’s too big and the tech it’s attached to it",
        "created_utc": "2024-05-22 02:53:44",
        "score": 2,
        "karma": 6488
    },
    {
        "body": "What if they are developing cloud computing platforms, and specialized software on top of their already robust hardware sales don't think that jenson huang isnt just sitting on his laurels theres a lot going on beyond GPUS this was just their catalyst to 2 trillion. They're hardware sales will be cyclical but the market is not going anywhere unlikely we see NVDA under 700 again.",
        "created_utc": "2024-05-21 19:45:31",
        "score": 6,
        "karma": 3652
    },
    {
        "body": "Lol NVDA announced Blackwell when they did because they knew they would have no trouble selling their Hopper production.",
        "created_utc": "2024-05-21 22:37:02",
        "score": 5,
        "karma": 663193
    },
    {
        "body": "You know people can preorder Blackwell right? ![img](emote|t5_2th52|4271)",
        "created_utc": "2024-05-21 22:21:40",
        "score": 2,
        "karma": 67136
    },
    {
        "body": "Nvidia, masters of silicon and AI, continue their inevitable climb to the top. Market dominance and elite status await—the others can eat our dust.",
        "created_utc": "2024-05-22 03:02:02",
        "score": 1,
        "karma": 1197844
    },
    {
        "body": "This reads like someone who gets high on Nvidia farts.\n\nWhat if? It's all over valued. Again, wake the fuck up. If you like line go up just say so but if you think line go up because of fundamentals then congratulations on being regarded.",
        "created_utc": "2024-05-21 19:47:07",
        "score": 4,
        "karma": 14783
    },
    {
        "body": "Well, well, well. Nvidia chips, you say? I may have to instruct my broker to acquire more.",
        "created_utc": "2024-05-21 17:50:45",
        "score": 10,
        "karma": 1197844
    },
    {
        "body": "Got it, put for nvidia",
        "created_utc": "2024-05-21 18:52:38",
        "score": 2,
        "karma": 2642
    },
    {
        "body": "You are still missing the possible version of the future where the AI bubble (mostly) bursts, because the technology didn't managed to make itself actually useful fast enough. I personally don't think it has any chance to live up to these insane inflated expectations it has garnered.\n\nAnd right now Nvidia's stock is mostly made up of hype value, not actual value. For that hype to actually turn into real value in the next 6 months of so, paradigms need to be shifted because of AI. I would argue that none of the current AIs are good enough to cause a paradigm shift.",
        "created_utc": "2024-05-21 22:26:38",
        "score": 1,
        "karma": 13403
    },
    {
        "body": "I see they built you with intel cheap chips instead of Nvidia ones which are strong with the force... Ai has nothing on humans, just copy and paste regurgitation ",
        "created_utc": "2024-05-22 02:44:04",
        "score": 2,
        "karma": 461
    },
    {
        "body": "Watch Nvidia turn up flat",
        "created_utc": "2024-05-21 16:24:47",
        "score": 27,
        "karma": 29980
    },
    {
        "body": "$NVDA for earnings is often fools gold. It's high risk and rarely a proper return for it. Implied move is around 8% for the ER tomorrow.  That means the stock needs to move either way $75. That $75 gets you break even.  For the ER trades on $EVDA to play out, you really need to get about $100 move.",
        "created_utc": "2024-05-21 20:56:56",
        "score": 2,
        "karma": 5905
    },
    {
        "body": "You just inspired me to short Nvidia puts. Thanks.",
        "created_utc": "2024-05-21 18:56:35",
        "score": 1,
        "karma": 137867
    },
    {
        "body": "I think he is going for a volatility play. Nvidia gets crushed tommorow then. He makes out like a bandit. Until daddy theta crushes his soul into a million pieces.",
        "created_utc": "2024-05-21 17:19:26",
        "score": 9,
        "karma": 12946
    },
    {
        "body": "Amazon announcing that they're skipping the current offerings from Nvidia and waiting for their upcoming chips today might be a good omen.\n\nIf the market was rational.",
        "created_utc": "2024-05-21 22:25:43",
        "score": 1,
        "karma": 36560
    },
    {
        "body": "This is the type of air pocket that could hurt the them in the short term. Blackwell demand may be pulling things out… but H200 is also basically a test chip for GB200, so it’s hard to say how material it is. Stock could dip, but if you were investing, would you sell knowing that Q4 and CY25 demand is stronger than ever? \n\nTough to say. I wouldn’t, but I’m also an idiot",
        "created_utc": "2024-05-21 13:48:21",
        "score": 223,
        "karma": 12905
    },
    {
        "body": "I misread it the first time, thinking they were pausing orders in general.  \n\nIt still seems like a power play to publicly announce this before earnings...like AMZN is testing the waters to see if they can pressure NVDA to give them higher priority for Blackwell GPU access or something.\n\nProbably just another sign of how much leverage NVDA has over everybody right now.\n\n----\n\n>**Amazon's cloud unit pauses orders of Nvidia's most powerful chip, FT reports**\n\n>(Reuters) - Amazon.com's cloud services unit has paused orders of Nvidia's most advanced \"superchip\" to wait for a more powerful new model, the Financial Times reported on Tuesday.\n\n>The new model called Blackwell, the chip sector heavyweight's new flagship AI processor, is expected to ship later this year, Nvidia said in March.\n\n>Amazon Web Services, the world's largest cloud services firm, had \"fully transitioned\" its previous orders for Nvidia's Grace Hopper chip, the report said.\n\n>Amazon and Nvidia did not immediately respond to Reuters requests for comment.",
        "created_utc": "2024-05-21 14:29:06",
        "score": 65,
        "karma": 7160
    },
    {
        "body": "💎✅.  Just love hearing Amazon is waiting on Nvidia",
        "created_utc": "2024-05-21 14:53:24",
        "score": 63,
        "karma": 7490
    },
    {
        "body": "Nvidia said any company that does this will be put in the back in the line for newer chips.",
        "created_utc": "2024-05-21 17:38:08",
        "score": 29,
        "karma": 10716
    },
    {
        "body": "*The company said the move “made sense” given “that the window between Grace Hopper and Grace Blackwell was small”.* \n\n\n ^^^small \n\n\n Also the article points out that there are still plenty of customers for Hopper. Still, even if this causes a dip, I will use that to buy more.  I don't do options but I'm long on NVDA.",
        "created_utc": "2024-05-21 14:27:28",
        "score": 12,
        "karma": 52719
    },
    {
        "body": "\"But AWS called the initial FT story \"misleading\" and \"inaccurate\" because the transition to Blackwell only applies to its Project Ceiba. That joint project between AWS and Nvidia aims to construct the world's largest cloud-based AI supercomputer.\n\n\"To be clear, AWS did not 'halt' any orders from Nvidia,\" an AWS spokesperson said in an email. \"In our close collaboration with Nvidia, we jointly decided to move Project Ceiba from Hopper to Blackwell GPUs (graphics processing units), which offer a leap forward in performance.\"\n\n[https://www.investors.com/news/technology/nvidia-stock-semiconductor-stocks-ai-chips-qualcomm-lam-research/](https://www.investors.com/news/technology/nvidia-stock-semiconductor-stocks-ai-chips-qualcomm-lam-research/)",
        "created_utc": "2024-05-22 00:06:50",
        "score": 5,
        "karma": 2496
    },
    {
        "body": "“Amazon Web Services, the world’s largest cloud computing provider, told the Financial Times that it had “fully transitioned” its previous orders for Nvidia’s Grace Hopper superchip, which was launched in August, and replaced them with its successor Grace Blackwell.”\n\nAka they cancelled their remaining orders for Grace Hopper, and then bulk ordered Grace Blackwell instead. Those orders are on the books for Nvidia and will likely be reported vaguely in this earnings tomorrow.\n\nThis isn’t even close to an air pocket lol, you guys need to think a little longer before typing.",
        "created_utc": "2024-05-21 18:26:36",
        "score": 3,
        "karma": 4673
    },
    {
        "body": "Didn't know Blackwell was in the closet. Not that there's anything wrong with that.",
        "created_utc": "2024-05-21 17:44:21",
        "score": 2,
        "karma": 210
    },
    {
        "body": "How about Amazon stop selling nVidia now? Or stop taking orders until nVidia stops selling to the Russians?",
        "created_utc": "2024-05-22 02:23:15",
        "score": 1,
        "karma": 50005
    },
    {
        "body": "Honestly, I hold some shares too and wouldn’t hate a decline right now… We know Q4 should be big with Blackwell deliveries starting. Hard to see how the stock price stays down long term even if it drops this week.\n\nThis morning’s climb feels like a mini rug pull coming, though. Story may be a nothing burger, but you’d think it would put a limit on how much it will climb before earnings… Was probably going to drop a bit before release anyway.",
        "created_utc": "2024-05-21 14:33:54",
        "score": 14,
        "karma": 12905
    },
    {
        "body": "https://www.reuters.com/technology/amazons-cloud-unit-pauses-orders-nvidias-most-powerful-chip-ft-reports-2024-05-21/",
        "created_utc": "2024-05-21 21:42:41",
        "score": 1,
        "karma": 445
    },
    {
        "body": "The last time I checked AWS was still the biggest cloud provider by some margin and the demand for cloud computing hasn't been decreasing at all. The demand for GPU will rise more and more especially.\n\nSo there is either a really simple explanation for this or Amazon knows something. Maybe they are covering the demand with their own AI chips? Either way it hurts $NVDA",
        "created_utc": "2024-05-21 18:48:34",
        "score": 14,
        "karma": 225461
    },
    {
        "body": "Oh no doubt, I own a small car repair shop. I started buying them like crazy, and now I get to lay off those damn over paid technicians. Thank you NVIDIA...to the moon.",
        "created_utc": "2024-05-21 18:02:18",
        "score": 6,
        "karma": 814
    },
    {
        "body": "Yes, but what it’s saying in this paragraph is the orders that were _NOT_ included in guidance, because they weren’t officially paid for yet, were cancelled in favor of Blackwell. This is a zero sum event from AWS, and in no way is modifying the expected revenue from NVIDIA this quarter. They had wanted to order 16k chips, ordered 10, then decided to just order another 10, but from the new Gen.",
        "created_utc": "2024-05-21 21:40:32",
        "score": 1,
        "karma": 4674
    },
    {
        "body": ">What makes NVIDIAs GPU immune to being copied by competitiors?\n\nEverything. What a stupid fucking question.",
        "created_utc": "2024-05-21 13:55:07",
        "score": 787,
        "karma": 2447
    },
    {
        "body": "CUDA bought calls dawg",
        "created_utc": "2024-05-21 13:56:15",
        "score": 72,
        "karma": 45321
    },
    {
        "body": "> What makes NVIDIAs GPU immune to being copied by competitiors?\n\nNVDA have been long on what is called [CUDA](https://en.wikipedia.org/wiki/CUDA), which is proprietary technology that they have been developing hard for the past 15 years or so. In the meantime, the competition has been sleeping, and they are so far behind on the parallelism aspect that it is laughable. That's why it can't just be copied.",
        "created_utc": "2024-05-21 14:45:40",
        "score": 92,
        "karma": 2199
    },
    {
        "body": "NVDA is priced more reasonably than CSCO was at the height of the dot com boom.  Their moat is much larger than Apple’s and the questions you’re asking are really the wrong ones.\n\nNVDA is focused on chip design and building out a whole GPU based platform.  NVDA outsources the manufacturing which is why you see TSM and ASML move in sync mostly.  Competitors using their platform would be amazing as it would solidify their moat as THE platform which would help them collect additional IP royalties potentially and would ensure their platform is the one companies go for (and need enterprise support for).\n\nThe big data centers will need to churn these cards between 18-36 months depending on how heavy loads are maintained and how well they want to maintain the cards.  Right now the big data centers are wiping out direct to enterprise by volume creating a vicious cycle.  A company can’t quickly direct order GPUs and build their own racks so they go to the big public CSPs for on demand capacity, which then leads to the CSPs buying more and keeping it further way from direct enterprise.  There are still times when you’ll run into on demand capacity issues in CSPs given all the compute is in use - it’s kind of wild a cloud provider can actually not have demand.\n\nThe real questions are:\n\nDoes TSM and ASML have any real capacity to support a competitor? (They currently really don’t)\n\nDo the CSPs see any slowing for GPU based resources? (They aren’t)\n\nWhen is the growth cycle predicted to slow and get into a maintenance cycle? (This is really the TBD everyone is trying to suss out)\n\nThere’s going to be a fine line between too much capacity and too little capacity.  Nvidia understands that very well which is why their software layers are extremely important.  They’ve done a good job of staying ahead of problems.\n\nPersonally I don’t like direct exposure to NVDA. It’s weighted heavily in SPY and QQQ so no need to pile any more on top.  It’s not Cyber Truck hype at all though.  Tesla is a car company trying to be a tech company so they need all the noise they can. NVDA is a tech company that does technology.",
        "created_utc": "2024-05-21 14:54:51",
        "score": 13,
        "karma": 1371
    },
    {
        "body": "You are getting some basic facts wrong. Specifically the part about the software. You have been able to run CUDA on AMD gpus for a long time now via [ZLUDA](https://github.com/vosen/ZLUDA). There’s no rumor. Good luck doing it in production though.\n\nThis alone tells me you have no clue. Good luck regard.",
        "created_utc": "2024-05-21 14:39:11",
        "score": 8,
        "karma": 253210
    },
    {
        "body": "Making GPUs is harder than making a base on the moon. Only Nvidia, AMD and Intel have the know how and tools.",
        "created_utc": "2024-05-21 13:53:17",
        "score": 35,
        "karma": 2528
    },
    {
        "body": "We are in the middle of the largest gold rush of all time and these are the shovels. They still have a long way to go, especially if they keep this innovation lead. They are 5 years ahead of the competition and not holding anything back, damn near obsoleting previous Nvidia releases every 6-8 months and selling to the top ten companies all racing to AGI",
        "created_utc": "2024-05-21 14:45:04",
        "score": 14,
        "karma": 560
    },
    {
        "body": "People treat Nvidia like they treated Cisco/Intel 25 years ago, thinking their moats would hold forever.\n\nEventually Cisco/Intel were indeed great companies for decades to come, but were still insanely overvalued on hype.\n\nSadly people don't realize basic economics: where margins are high competition eventually comes for it. And Nvidia's margins are astronomical.\n\nCompetitors don't need the best GPUs, Nvidia may have that crown forever, who knows, generally doesn't happen in hardware forever, but let's assume it happens, they need to be more cost efficient or power efficient to sell a lot.\n\nAnd that's assuming that the need for GPUs is going to be endless and that no new software/hardware paradigm may shift to different accelerators.",
        "created_utc": "2024-05-21 15:46:50",
        "score": 13,
        "karma": 1750
    },
    {
        "body": "Indeed. Nvidia sells mainly to other companies, but all profits are always ultimately extracted from the end consumer. In case of Nvidia, there are then significant lags in this process which can cause Nvidia to do well as judged by its sales to other companies. And then later it can transpire that these other companies cannot make high enough profits using what they bought from Nvidia to justify those investments.\n\nThat the true market for AI as far as the current LLMs is concerned is much smaller than is priced in, can be easily seen by considering how much consumers are willing to pay for any new AI-powered products or services. Companies like Apple, Microsoft, Amazon etc. are not going to sell their new AI-upgrades of their old product at much higher prices.\n\nMicrosoft will not replace Windows 11 by a much more expensive Windows AI. If they were to do that then no one would switch to Windows AI. So, the revenues for Microsoft will stay pretty much the same, while they must invest in AI, so their profits may actually go down.",
        "created_utc": "2024-05-21 14:57:55",
        "score": 8,
        "karma": 259
    },
    {
        "body": "God these types of posts are so weak and pathetic. You could’ve done anything but you wasted your time to post this lol. You don’t even understand the value of Nvidia and you couldn’t be more wrong with everything you stated.",
        "created_utc": "2024-05-21 14:49:39",
        "score": 9,
        "karma": 11808
    },
    {
        "body": "Nvda doesn’t fucking make gpus. The company that makes them already reported. As did nvidia’s customers. Jesus.",
        "created_utc": "2024-05-21 15:04:16",
        "score": 3,
        "karma": 48326
    },
    {
        "body": "Anyone who is big into gaming knows just how long we have been hearing \"AMD will have GPUs that provide alternative options any day now,\" yet it never happens.  NVIDIA have always been king when it comes to GPU, and there is no reason to believe that will suddenly change.",
        "created_utc": "2024-05-21 17:49:08",
        "score": 5,
        "karma": 86918
    },
    {
        "body": "- The current market price (~950) discount a revenue growth of about 20% for the next decade. I think it is feasible given the very high expected capital expenditures of data centers.\n\n- I believe they will maintain their margins thanks to their durable competitive advantage: CUDA\n\n- there are many ways this can go wrong but also many ways it can get better\n\nAll in all, in my view Nvidia is appropriately priced. Regarding the S&P 500 concentration in M7, it’s a real concern, I think now it is more important than ever for the US investor to have international exposure.",
        "created_utc": "2024-05-21 14:47:43",
        "score": 2,
        "karma": 263
    },
    {
        "body": "The data center business is growing, 20%+ annually, more than an estimated order of magnitude in addressable market to go. Nvidia has the lion’s share of that market, locked for at least another year. They are leagues ahead of everyone else, amazing R&D, great management and incredible margins. They may well become the largest company in the world soon. Who else? Proctor and Gamble?",
        "created_utc": "2024-05-21 15:04:50",
        "score": 2,
        "karma": 4734
    },
    {
        "body": ">anyone that actually works in a data center can attest they don't upgrade their servers every 6 months, they don't need to buy new hardware every year either.\n\nSure, but LLM processing isn't run on a DL360 G8. There is hunger for training GPUs, and it's not going anywhere. [Cloud services are eating up GPUs](https://lambdalabs.com/?matchtype=p&adgroup=55786367910&feeditemid=&loc_interest_ms=&loc_physical_ms=9009736&network=g&device=c&devicemodel=&adposition=&utm_source=google&utm_campaign=Google_Search_Brand&utm_medium=search&utm_term=lambda%20labs&utm_content=397107687029&hsa_acc=1731978716&hsa_cam=1054662654&hsa_grp=55786367910&hsa_ad=397107687029&hsa_src=g&hsa_tgt=kwd-315332575824&hsa_kw=lambda%20labs&hsa_mt=p&hsa_net=adwords&hsa_ver=3&gad_source=1&gclid=Cj0KCQjwjLGyBhCYARIsAPqTz1-Gpc4T90hvAojjB4N7uizNGMbAab-fiacRIOYhV1vhrMEQ1DyWQ7UaAgSJEALw_wcB) as fast as they can buy them. And as much as I love AMD, they have a lot of work to do to to compete with Nvidias software stack. There's a certain amount of inertia now- people have invested in the tooling, so they will stay with Nvidia rather than reworking their models for another software stack.",
        "created_utc": "2024-05-21 15:07:04",
        "score": 2,
        "karma": 84172
    },
    {
        "body": "> What makes NVIDIAs GPU immune to being copied by competitiors?\n\nDesigning GPUs is hard. The lithography equipment to produce the very top-end chips are exceedingly expensive and only comes from a couple companies. These chips can basically only be produced by TSMC, and they don't have a habit of allowing their fabs to be used to knock off the designs of their best customers (they have an interest in costs staying high).\n\n>It's only a matter of time before a competitor releases something for a fraction of the price.\n\nSee above. The barriers to entry are *huge*. It takes years and *billions* of dollars to build a fab capable of producing high-end chips. This is literally the most complex manufacturing process ever devised by humans.\n\nIs this a bubble? Absolutely. But it won't pop because high-end AI chips suddenly start being produced en masse in Bangladesh or Vietnam.",
        "created_utc": "2024-05-21 15:13:05",
        "score": 2,
        "karma": 19562
    },
    {
        "body": "NVIDIA is making software models. Their models will be built on chips not yet released to the public. They will be full stack AI and better than everyone else.",
        "created_utc": "2024-05-21 15:13:58",
        "score": 2,
        "karma": 747
    },
    {
        "body": ">Why is everyone so bullish on NVIDIA?\n\nAre you fucking regarded?",
        "created_utc": "2024-05-21 15:20:53",
        "score": 2,
        "karma": 2634
    },
    {
        "body": "Nvidia is practically the only manufacture of AI chips. \n\nIf you think AI is just a fad like how people believed the internet was going to be just a fad, then that makes sense.",
        "created_utc": "2024-05-22 00:07:09",
        "score": 2,
        "karma": 971
    },
    {
        "body": "https://www.investing.com/news/stock-market-news/amazons-cloud-unit-pauses-orders-of-nvidias-most-powerful-chip-ft-reports-3450163",
        "created_utc": "2024-05-21 15:20:04",
        "score": 2,
        "karma": 2024
    },
    {
        "body": "They have a competitors: AMD. Intel as the biggest ones\n\nAnd no, they are not easy to copy an even if, there are no Manufacturers apart from TSMC, wich can't even keep up with current clients demands. \n\nOnly thing that could pop is the whole AI hype, once people realise that, while quite neat in some cases, LLM's have nothing to do with intelligence. That would drive demand down and certainly Nvidia stock.",
        "created_utc": "2024-05-21 18:57:43",
        "score": 4,
        "karma": 654
    },
    {
        "body": "I’ll leave this here..nvidia biggest costumers are like 3 big companies and most of the revenue comes from them. If one cancels their contract then what lol",
        "created_utc": "2024-05-21 15:39:23",
        "score": 2,
        "karma": 3034
    },
    {
        "body": "they have a complete monopoly on a huge market and crazy margins. their only competition is big cloud ai making their own custom chips, but as long as nvidia keeps making new chips its hard to see them lose their market share\nI don't think people realize just how much AI will replace jobs and replace it with paid  high margin services",
        "created_utc": "2024-05-21 14:40:28",
        "score": 1,
        "karma": 1327
    },
    {
        "body": "NVIDIA is calling",
        "created_utc": "2024-05-21 14:52:00",
        "score": 1,
        "karma": 1934
    },
    {
        "body": "Respectfully bro if you know nothing about the technology behind Nvidia’s GPU’s and how they got where they’re at now then your opinion is totally worthless. \n\nI’m not saying that the stock won’t go down but you genuinely have no idea what you’re talking about",
        "created_utc": "2024-05-21 14:54:49",
        "score": 1,
        "karma": 172352
    },
    {
        "body": "How many of these GPUs have they actually delivered? How many gpus do these big tech companies actually need? What makes NVIDIAs GPU immune to being copied by competitiors?\n\nIf you understood anything about semiconductors you would know that nobody is even close to achieving the performance NVIDIA has. I agree to some of the points but some of this is just waffle.",
        "created_utc": "2024-05-21 15:02:08",
        "score": 1,
        "karma": 438
    },
    {
        "body": "If nvidia pops, I am buying all the shares that I can afford. \\~8?",
        "created_utc": "2024-05-21 15:11:46",
        "score": 1,
        "karma": 488
    },
    {
        "body": "Lmfao clearly you don’t know NVDA, currently no one is topping them. AMD and INTEL are playing catch up. AMD has been pretty good but not nvidia levels.",
        "created_utc": "2024-05-21 15:12:48",
        "score": 1,
        "karma": 501
    },
    {
        "body": "Then short Nvidia pussy",
        "created_utc": "2024-05-21 15:25:14",
        "score": 1,
        "karma": 502
    },
    {
        "body": "If the Blackwell data centers are the real deal, NVDIA will be the most important stock AND company on Earth",
        "created_utc": "2024-05-21 15:41:04",
        "score": 1,
        "karma": 22566
    },
    {
        "body": "People treat Nvidia like they treated Cisco/Intel 25 years ago, thinking their moats would hold forever.\n\nEventually Cisco/Intel were indeed great companies for decades to come, but were still insanely overvalued on hype.\n\nSadly people don't realize basic economics: where margins are high competition eventually comes for it. And Nvidia's margins are astronomical.\n\nCompetitors don't need the best GPUs, Nvidia may have that crown forever, who knows, generally doesn't happen in hardware forever, but let's assume it happens, they need to be more cost efficient or power efficient to sell a lot.\n\nAnd that's assuming that the need for GPUs is going to be endless and that no new software/hardware paradigm may shift to different accelerators.",
        "created_utc": "2024-05-21 15:46:50",
        "score": 1,
        "karma": 1750
    },
    {
        "body": "I'm sour I dumped my Nvidia shares 20+ yrs ago at 20 because I was like gaming is taking off where's my lambo",
        "created_utc": "2024-05-21 15:53:20",
        "score": 1,
        "karma": 2803
    },
    {
        "body": "I see someone is salty for not buying Nvidia under $200, $300 or $500",
        "created_utc": "2024-05-21 15:53:33",
        "score": 1,
        "karma": 111084
    },
    {
        "body": "Lol comparing nVidia GPU business to Cybertrucks. Bravo.",
        "created_utc": "2024-05-21 15:54:07",
        "score": 1,
        "karma": 481
    },
    {
        "body": "It is not just CUDA. Nvidia hardware is the real deal, something AMD has been chasing for more than a decade and never catch up.\nIf you do not want to fall behind on AI race, you pay for Nvidia gpu.\nBetter tools >>> easier for your engineers to focus on what they do.",
        "created_utc": "2024-05-21 15:56:37",
        "score": 1,
        "karma": 8593
    },
    {
        "body": "I love how your dumbass knows absolutely nothing but because it's the internet you get to have a voice anyway. \n\n  \n\"What makes NVIDIAs GPU immune to being copied by competitiors?\" They are trying to do this as we speak. Turns out it's fucking difficult",
        "created_utc": "2024-05-21 16:05:19",
        "score": 1,
        "karma": 27614
    },
    {
        "body": ">What makes NVIDIAs GPU immune to being copied by competitiors?  \n\nmaybe because you can't just copy other people shit dumbass? They wouldn't be able to effectively innovate or improve upon Nvidia's design because they don't know how Nvidia got to that design in the first place and even if they could just take the exact design and start getting the GPU's made, they would constantly be 2 years behind Nvidia anyways because that's slow it is between starting to make the chips, putting them on a graphics card and selling them.  \n\ngo back to watching linus tech tips",
        "created_utc": "2024-05-21 16:06:35",
        "score": 1,
        "karma": 28192
    },
    {
        "body": "Could NVDA move down after a moment in time event like this week’s earnings? Sure , Expectations are sky high so even a slight misstep could temporarily trigger a sell off of 10% or something really non catastrophic. That said thinking long term it is highly likely that the stock is significantly undervalued. As someone who works in this space it’s important to note that 1) it will still take years for competitors to catch up with Nvidia with respect to generative Ai infrastructure and 2) rather than being a bubble or buzzword these developments in  the realm of Gen Ai / LLMs etc are akin to the greatest technological breakthroughs of all time such as the advent of the printing press, steam engine, and the internet itself.",
        "created_utc": "2024-05-21 16:09:19",
        "score": 1,
        "karma": 466
    },
    {
        "body": "Perhaps Market thinks that AI is around the corner and it can only run on nvidia GPU. If these 2 things happens, Nvidia will become the second biggest company in the world beside the company that actually owns AI itself.",
        "created_utc": "2024-05-21 16:18:39",
        "score": 1,
        "karma": 1080
    },
    {
        "body": "Trying to compare NVIDIA to cybertruck is about the most ridiculous and uneducated thing I have ever heard",
        "created_utc": "2024-05-21 16:20:13",
        "score": 1,
        "karma": 5563
    },
    {
        "body": "This is so wrong lmao Nvidia's bread and butter is the fact that their GPUs handle AI and machine learning better than anything else. Seeing as how everyone is counting on that to be the next big thing it's only logical that the company that produces a vast majority of these GPUs has a very high valuation. I'm not sure what you're missing here, maybe you think Nvidia is still focusing on gaming.",
        "created_utc": "2024-05-21 16:21:26",
        "score": 1,
        "karma": 17908
    },
    {
        "body": "There is no doubt in my mind that competitors will release products that are equally, if not more capable than what NVIDIA is offering, eliminating NVIDIA’s monopoly and tanking their stock price… eventually. Is that going to happen this year? Almost certainly not.",
        "created_utc": "2024-05-21 16:21:44",
        "score": 1,
        "karma": 944
    },
    {
        "body": "This is a learning experience. If you want something else that “doesn’t make sense” about the market, nvidia is similar to alphabet. Alphabet has two shares purchasable, GOOG and GOOGL, GOOGL has voting rights, GOOG does not. GOOG has persistently sold at a higher value despite this. Learn why, and the reason why NVIDIA is as it is will make sense.",
        "created_utc": "2024-05-21 16:22:31",
        "score": 1,
        "karma": 973
    },
    {
        "body": "yea idgaf, nvidia made me money, keep betting on this rocketship",
        "created_utc": "2024-05-21 16:29:41",
        "score": 1,
        "karma": 546
    },
    {
        "body": "What you say: super informative and logic stuff\nWhat i hear: all in short Nvidia",
        "created_utc": "2024-05-21 16:40:02",
        "score": 1,
        "karma": 128
    },
    {
        "body": "What I’m afraid of most:  \n\nCyclical nature in Nvidia’s space. Usually there’s a ramp up in hardware by companies then a noticeable drop in orders occurs. I fear Nvidia is going beyond the moon but should be more closer to the moon. \n\nOne thing that might mitigate this is their new software approach. Making AI practically a turn key approach. If they get consistent subscriptions then this cyclical talk is vastly minimized. \n\nEither way I’ll be eating popcorn 🍿 on the sidelines. Let you hyenas go at it. Good luck!",
        "created_utc": "2024-05-21 16:43:46",
        "score": 1,
        "karma": 56732
    },
    {
        "body": ">what makes nvidias gpu immune to being copied by competitors\n\nlol",
        "created_utc": "2024-05-21 16:46:19",
        "score": 1,
        "karma": 14401
    },
    {
        "body": "Crypto will eventually be regulated as a security, turning every miner's balance sheet red for the indefinite future. When that happens the value of compute will plummet, and NVIDIA will come down at the same time.\n\nIt'll be the dot com bubble bursting all over again.",
        "created_utc": "2024-05-21 16:57:34",
        "score": 1,
        "karma": 44815
    },
    {
        "body": "lmfao 62.3% of nasdaq gains are because of Nvidia stock ripping, as long as the AI bubble continues, it'll keep mooning. 🥱",
        "created_utc": "2024-05-21 17:07:19",
        "score": 1,
        "karma": 76
    },
    {
        "body": "You see all the traffic on the road everyday? We're going to eliminate it significantly because of Nvidia.\n\nThat alone justifies the stock price...not even talking about whatever else will come with it.",
        "created_utc": "2024-05-21 17:13:52",
        "score": 1,
        "karma": 25500
    },
    {
        "body": "When Nvidia tanks, GameStop will rip. Calling it!",
        "created_utc": "2024-05-21 17:19:25",
        "score": 1,
        "karma": 1952
    },
    {
        "body": "Nvidia is never leaving my portfolio, nice try bear",
        "created_utc": "2024-05-21 17:20:32",
        "score": 1,
        "karma": 30946
    },
    {
        "body": "We are on the precipice of the greatest gold rush in human history and Nvidia sells shovels. There is next to no meaningful machine learning done without the chips at this point. \n\nTech can go on and on about wanting to diversify into AMD but their chips suck and the software supporting them is even worse. There is no viable alternative to Nvidia’s product. No one has anything even close to CUDA for gpu programming. \n\nIt’s entirely plausible that they are the largest company on earth in a decade.",
        "created_utc": "2024-05-21 17:23:45",
        "score": 1,
        "karma": 41695
    },
    {
        "body": "I know you're right, and sooner than later WSB will be right in the bear thesis but right now NVIDIA is balls deep in Jenson Huang leather jacket.",
        "created_utc": "2024-05-21 17:23:52",
        "score": 1,
        "karma": 45356
    },
    {
        "body": "I'm long term bearish on Nvidia but even I gotta admit it's more likely that Nvidia doubles before it crashes. They do have a moat but that's only guaranteed for years, not decades. People underestimate the amount of change that's gonna take place in the market on the long time frame with the entrance of competitors, and all major tech companies looking for ways to wean themselves off of Nvidia with home grown chips. Instead they will continue to price in secular growth for eternity and be surprised when that doesn't transpire.\n\nNVDA to 2000 then back to 600 by 2035",
        "created_utc": "2024-05-21 17:30:07",
        "score": 1,
        "karma": 24539
    },
    {
        "body": "This article gives huge reasons for why its time to sell NVDA\n\nNVDA made cash cause it had price power and had a needed product that was scarce\n\nIt now will have more competition cause lower prices, will lose customers that are making their own chips, and compete against the customers making their own chips that can also be sold.\n\nnot to mention that NVDA is grossly overvalued, even more than the other Mag 7  \n[https://www.fool.com/investing/2024/03/13/10-reasons-wont-touch-ai-stock-nvidia-10-foot-pole/](https://www.fool.com/investing/2024/03/13/10-reasons-wont-touch-ai-stock-nvidia-10-foot-pole/)",
        "created_utc": "2024-05-21 17:31:06",
        "score": 1,
        "karma": 21522
    },
    {
        "body": "I was waiting for the I have calls on Nvidia at the end of the post.",
        "created_utc": "2024-05-21 17:34:45",
        "score": 1,
        "karma": 8568
    },
    {
        "body": "The only thing that got me confused at recent OpenAI demo, is that they are making chatGPT4o voice and video options available to everyone, not just paid users. Then I realized - fuck, this Nvidia chips are actually cheap for them, not expensive. So cheap that OpenAI can get all these compute power to non paying users.  Imagine you are in business of renting electric cars, say Teslas. And another electric car company comes to you and says we will sell you car that goes 8 times the range of you tesla on the same charge. Wouldn’t you buy these cars? You will have to because your customers will demand this specific cars, they don’t want Tesla anymore.  Because even if they pay more price, the price of using these vehicles will be much lower.  That’s what Nvidia does , it accelerates computing and it makes it very very cheap to use it at the same time.  No, the question is, at what point you will say you have enough of these chips.  Jensen answered that question. There is about 1 trillion dollars in “old” data centers in the world.  And apparently, old data centers will keep losing customers because the price of compute they provide is too high, and they can’t even compute at the speed that is needed for new applications (AI). Given that the new Nvidia chips that is coming later this year, and others after that, and the speed of AI development, the world would need as much of chips as they can get that are providing as low price of using those chips as possible. We don’t know where is AI going, so we can’t know when the world would say they have a enough chips, and that they don’t need even more efficient chips.",
        "created_utc": "2024-05-21 17:37:43",
        "score": 1,
        "karma": 1012
    },
    {
        "body": "lol @redditors who think nvidia is just a company that makes video game gpus…\n\nlol the nvidia DGX platform is what nearly every AI including OpenAI built on and the nvidia library is the basis for most newborn AI constructs",
        "created_utc": "2024-05-21 18:22:59",
        "score": 1,
        "karma": 86679
    },
    {
        "body": "To the first question: No idea. I sold my NVidia stocks a while ago for a good profit. Strongly convinced the current price is overvalued.\n\nThat said, they actually do have great revenue and unlike software, hardware can be quite difficult to just copy. You need the manufacturing process.\n\nSo IMHO Nvidia is currently overvalued and is likely to come down, but they're nowhere near as worthless as you make it sound. And their business numbers are pretty solid.",
        "created_utc": "2024-05-21 18:38:48",
        "score": 1,
        "karma": 26052
    },
    {
        "body": ">What makes NVIDIAs GPU immune to being copied by competitiors?\n\nI recommend you read this description of what it takes to create a modern CPU. A new factory costs 20 billion dollars. The work floor air is 100 times cleaner than an hospital operating room. The lighting is yellow because certain frequencies throw off the production process. The precision is measured in nanometers, so the slightest vibration or flaw in the machinery can throw everything off.\n\nNVIDIA is the best in the world at this. Can they be copied? Sure. But it's kind of like saying, can Magnus Carlsen's chess skills be copied? Technically yes, but good luck figuring out how to do it.\n\n[https://www.construction-physics.com/p/how-to-build-a-20-billion-semiconductor](https://www.construction-physics.com/p/how-to-build-a-20-billion-semiconductor)",
        "created_utc": "2024-05-21 18:40:23",
        "score": 1,
        "karma": 8895
    },
    {
        "body": "Knowing WSB, NVIDIA is gonna pop a $7 eps and destroy everything",
        "created_utc": "2024-05-21 18:55:30",
        "score": 1,
        "karma": 69471
    },
    {
        "body": "Ai isn't going anywhere and nvidia the the leader by a lot.\n\nThey just announced another major advancement as well.",
        "created_utc": "2024-05-21 19:01:51",
        "score": 1,
        "karma": 1275
    },
    {
        "body": "When Nvidia crosses 1k it's gonna go full regard lol fuck your puts",
        "created_utc": "2024-05-21 19:25:51",
        "score": 1,
        "karma": 96765
    },
    {
        "body": "Whoever does not accept that this bubble will burst in one way or the other is just desilusional. For sure AI is here to stay, but the market will always return to balance somewhen. Even considering AI could be an equivalent to the internet-phenomenon, NVIDIA still is only one company within a widely grown global market.",
        "created_utc": "2024-05-21 19:30:35",
        "score": 1,
        "karma": 3525
    },
    {
        "body": "99% of their value is from growth of revenue. Every top company in the world wants their chips. Ai has so much further to grow. NVIDIA will always outpace the other competitors because they have the biggest budget to put towards innovation. Right now only the biggest companies can get their hands on these chips, so even if they stop wanting these chips more mid size companies will scoop them up.",
        "created_utc": "2024-05-21 19:33:18",
        "score": 1,
        "karma": 2043
    },
    {
        "body": "OP is just assuming nvidia will lose its moat and the guidance will come in weak.\n\nThe thing is...it will take so much longer for nvidia to be dethroned. They just started. By the time they launch anything, nvidias compute power doubled again.",
        "created_utc": "2024-05-21 14:50:34",
        "score": 246,
        "karma": 102854
    },
    {
        "body": "I mean, it's pretty obvious. Right now NVDIA is worth more than the entire oil market in wall street. It's just impossible for NVDIA to be worth that much. It's just hype, and one day, probably not next week, but one day when people understand that it's impossible for NVIDIA to make more money than Apple, it'll have a rough correction.",
        "created_utc": "2024-05-21 15:28:11",
        "score": 31,
        "karma": 46410
    },
    {
        "body": "The thing with Nvidia popping is that means that either A.Intel or some other gpu company found a solution(idk how much amd is putting into the ai market) B. China finally caught up. C. A better way of machine learning was found and that company is the next Nvidia\n\nso Like… Market is going to stay the way it is",
        "created_utc": "2024-05-21 16:23:05",
        "score": 3,
        "karma": 13278
    },
    {
        "body": "Why are intel so stupid, can’t they just copy Nvidia?",
        "created_utc": "2024-05-21 15:11:51",
        "score": 20,
        "karma": 16514
    },
    {
        "body": "The only thing that determines nvidias stock price is forward guidance, massively beating is priced in…if guidance is strong, stock goes up, that simple",
        "created_utc": "2024-05-21 14:49:25",
        "score": 13,
        "karma": 4260
    },
    {
        "body": "Part of their moat is also by large their ability to attract and keep top 2% engineers. They are constantly pushing the technological limits. You have to have an environment that fosters this kind of \"lets gooo!\". This is hard to replicate. Every time I listen to Intel engineers being happy getting 10% more efficiency out of five year old tech I turn it off. AMD is on Nvidias tails but too much focused on \"having the numbers right\" then to wow the industry. They do it occasionally but not enough to get on NVidias throne. I would wish AMD would seek more outside investment then relying on bread+butter cpus to finance slow dev",
        "created_utc": "2024-05-21 16:43:51",
        "score": 70,
        "karma": 103204
    },
    {
        "body": "I'm a tech enthusiast, not a wall street guy. I hate NVIDIA because they're one of the most reactionary and psychopathic \"growth at all costs\" companies I've ever seen, but with the advent of AI even I had to start buying shares. They positioned themselves beautifully as the premier company in the gaming, crypto, and ML markets, all three of which should continue to grow for the next decade or more. \n\nTheir only real competitor is AMD, who simply cannot catch up due to the insane mindshare NVIDIA has accumulated over the years. AMD could release something just as powerful as a 4090 tomorrow, for half the price, and still fail to gain market share.",
        "created_utc": "2024-05-21 16:18:52",
        "score": 49,
        "karma": 16244
    },
    {
        "body": "AI would have to be exposed as woo/bullshit/vaporware for Nvidia to lose its moat. Or Intel, AMD, etc need to develop a serious competitor to Cuda. The first one should happen in the near future, but won't. The second one is a massive undertaking. Even if a competitor pops up, they will need Cuda customers to migrate to it, or on board new applications that aren't already on Cuda.",
        "created_utc": "2024-05-21 20:41:19",
        "score": 3,
        "karma": 85299
    },
    {
        "body": "nvidia doesn't need to be dethroned to have the stock collapse.  Literally any competition and they wouldn't be able to sell $500 chips for $10,000 to AI customers.  Nobody has to actually surpass them, they just have to barely be good enough to end the monopoly.",
        "created_utc": "2024-05-21 17:45:19",
        "score": 2,
        "karma": 96191
    },
    {
        "body": "[These](https://www.carahsoft.com/nvidia/contracts) are the government contracts NVIDIA has. One goes to 2028. So PUTS on NVIDIA. But I’m no legal financial advisor blah blah blah, subjective opinion.",
        "created_utc": "2024-05-21 16:31:15",
        "score": 27,
        "karma": 54034
    },
    {
        "body": "It's Nvidia not AWS.",
        "created_utc": "2024-05-21 16:52:59",
        "score": 8,
        "karma": 7603
    },
    {
        "body": "One day NVIDIA will have competition. One day...",
        "created_utc": "2024-05-21 17:04:11",
        "score": 10,
        "karma": 1514
    },
    {
        "body": "If people bought amd and nvidia at the time of your comment and post they would’ve 16x in 5 years in two trades on stocks. That’s insane",
        "created_utc": "2024-05-21 17:22:04",
        "score": 47,
        "karma": 1177
    },
    {
        "body": "I worked at Nvidia. Here’s why Nvidia will 5x from here. Two words. Government subsidies. Chips for america is about to make Nvidia margins that are already insane, even more insane",
        "created_utc": "2024-05-21 16:51:12",
        "score": 195,
        "karma": 2755
    },
    {
        "body": "5 years ago I wrote a paper as part of a research class about the proliferation of computer architectures and slowing of Moores law. My main argument was that GPUs or other highly parallel architecture would supplant CPUs even for general purpose computing. I cited Nvidia’s massive computing gains and speculated they’d be bigger than intel. They were worth like <40 bucks a share then, market cap half of intel around $100B. \n\nBeing a college student, I had no money to invest. I put some in over the years but not nearly what I wanted to. Then I fucking sold and had to rebuy in. Still up a solid amount but I learned a lesson to stick to my guns and not try and time the market when it comes to sea changes like this. ",
        "created_utc": "2024-05-21 17:58:28",
        "score": 8,
        "karma": 1424
    },
    {
        "body": "Their tech dominance is years ahead of the competition. I’m not here to knock AMD, but I work in high tech software and can’t tell you anyone that’s building next gen software on anything AMD. \n\nIf you believe that the proliferation of AI is on us. I would argue it is. It’s clearly evident that LLMs are here and useful and only going to get better, then you’ll need every increasing computing resources for them. NVIDIA is exceptionally positioned to capture that. \n\nFeel free to bet against this, there will be some correction at some point, but long term they are an exceptionally well positioned (and managed) business.",
        "created_utc": "2024-05-21 20:48:20",
        "score": 2,
        "karma": 490
    },
    {
        "body": "Nvidia has spent over a decade writing CUDA to corner the market on GPU processing. Sure AMD can make chips but talk to a real programmer and they only want to touch CUDA libraries as they work and are well documented.",
        "created_utc": "2024-05-21 14:51:38",
        "score": 16,
        "karma": 91245
    },
    {
        "body": "When he said \"make\" he meant design, and he is correct. Intel, AMD, and Nvidia are the only players make discrete GPU.",
        "created_utc": "2024-05-21 14:42:49",
        "score": 12,
        "karma": 6556
    },
    {
        "body": "I’ll let you in on a little difference, check out nvidia revenue growth and margins the last year and now take a look at Tesla’s, does anything stand out to you?",
        "created_utc": "2024-05-21 14:48:22",
        "score": 3,
        "karma": 4260
    },
    {
        "body": "They don’t need to 10x their revenue if they can improve their margins. That’s why everyone will be watching margins and guidance. Those are the two most important factors. Walmart makes a 5B profit on 161B in revenue. JPM makes 13B on 40B in revenue. It’s entirely about the margin. Apple isn’t NVidia, and NVDA isn’t AAPL. I see no reason why Apple’s market cap shouldn’t be smaller than NVidia’s if they not only continue to drive revenue higher but improve margin as well. \n\nNVDA is 29x the average forward earnings, which is in the middle of the 25-34x historical multiple. Every single quarter the company grows into those expectations. That’s why we’re at the place that we’re at. \n\nThey’re going to top revenue expectations, without question. They’re going to offer super positive guidance. Jensen is going to showcase everything they’re working on and it will seem like he’s offering you the year 2050, especially if he says anything about AGI within the end of the decade. All of that will be enough to push $1,000. But, if they have above average expansion on the margin side, that’s what will absolutely explode the price upward tomorrow night. There’s a good reason to be bullish NVDA, and even if the market has priced a lot of this in and we see $850 Thursday morning, as long as they can continue to improve margins and overcome some of the bottleneck issues seen at AMD, ASML, AMAT, etc., then NVDA will take Apple’s place within a year. As a trade, I’ll wait to see what they have done. But I think the assumption that this company shouldn’t have the highest market capitalization just because they don’t equal the revenue of Apple is more than missing the point. If NVDA were running AAPL’s revenue at NVDA’s margins, NVDA would already be twice the market cap of AAPL and it wouldn’t even be close.",
        "created_utc": "2024-05-22 03:54:02",
        "score": 2,
        "karma": 5999
    },
    {
        "body": "MSFT GOOG and AMZN are already designing their own chips and starting the scale out over the next few years. Nvidia is going to absolutely tank when their orders fall off a cliff in a couple of years.",
        "created_utc": "2024-05-21 18:58:58",
        "score": 2,
        "karma": 49124
    },
    {
        "body": "AMD is still constrained. They’ve grown tremendously but people forget how much more money Nvidia and Intel have for R&D\n\nIt’s a miracle AMD is pulling off what they are at all tbh.\n\nLisa is the goat.",
        "created_utc": "2024-05-22 02:35:15",
        "score": 3,
        "karma": 42452
    },
    {
        "body": "Nvidias up only because of AI. The market cap of the rest of those businesses is 200B max\n\nIn AI their competiton is not amd\n\nIt’s their biggest customers using their own chips.  Microsoft and meta designed their own GPUs so it’s just a matter of time.  They make up 2/3 of nvidia sales so uhh.. PE70 seems ☠️",
        "created_utc": "2024-05-22 01:31:05",
        "score": 2,
        "karma": 248020
    },
    {
        "body": "They have to undermine the cost to value OR reduce the demand of nvidia chips.\n\nI dont see that happening.",
        "created_utc": "2024-05-21 18:24:50",
        "score": 7,
        "karma": 102854
    },
    {
        "body": ">  Literally any competition and they wouldn't be able to sell $500 chips for $10,000 to AI customers.\n\nTSMC is maxed out.  \n\nEven if other people come along, AI companies will just buy from them and from NVIDIA both.  \n\nThey are literally buying everything anyone makes that's even remotely good.  \n\nPrices will not go down unless TSMC+Intel build more fabs or the AI buble as a whole pops.",
        "created_utc": "2024-05-21 19:34:22",
        "score": 5,
        "karma": 134859
    },
    {
        "body": "yup. the amount of compute needed to get to AGI from our current hallucinating chatbots, is astronomical. \n\nand getting there first is a national security issue. anyone who doesn't understand how early we still are is short-sighted.\n\nnvidia is an easy 3x in the next 5-10 years.",
        "created_utc": "2024-05-21 20:04:09",
        "score": 4,
        "karma": 213903
    },
    {
        "body": "We are talking about GPUs, not CPUs, about Nvidia and not about Intel. We are also not talking about rack swaps, I said contrary to OPs statement they do need to buy new hardware every year and hence also upgrade these servers.",
        "created_utc": "2024-05-21 14:36:37",
        "score": 41,
        "karma": 38303
    },
    {
        "body": "Intel already has its own facilities. It's actually the only chip company that does. It also already makes GPUs which deliver cheaper compute power than Nvidia does. All that's missing is the software integration.",
        "created_utc": "2024-05-21 16:55:22",
        "score": 3,
        "karma": 7603
    },
    {
        "body": "I meant using AI , not the compute infrastructure itself. I would be very surprised if Nvidia are not using AI to help design their chips. I am assuming the post I replied to meant they were using Nvidia gpus to run AI models to help him produce new chips. Nvidia chips aren't that much use when it comes to highly branching workloads, which you would require when testing logical output on chip designs. Long decision free instruction pipelines, for sure. Anything that requires the path of execution to make lots of logical decisions and branch often, they are terrible at.  Thats why they are so fast at specific workloads like graphics rendering or matrix multiplications.",
        "created_utc": "2024-05-21 16:52:04",
        "score": 2,
        "karma": 91872
    },
    {
        "body": "To your points:  \nI do long read single molecule sequencing. Basecalling the reads is computationally intensive. It requires CUDA. They're not even considering supporting anything else because NVIDIA GPUs are priced fairly compared to competitors *and* they do CUDA and no one else does.",
        "created_utc": "2024-05-21 15:53:20",
        "score": 2,
        "karma": 23116
    },
    {
        "body": "Yeah. Well. Ok if we look at the dollar halfing every decade. It’s like saying that Nvidia will be 3-4T marketcap of todays money in a decade lol.\n\n\nTop company and market cap:\n\nCapitol group 500B (2008)\nApple 1T (2018)\n\nToday… Msft ? I think 3.2T (2024)\n\n\nSooooooo 10 years from now…. ______ 10T (2035) \n\nKinda looks like an underestimate. \n\nI’m regarded so you gotta check fudged math here.",
        "created_utc": "2024-05-21 17:36:47",
        "score": 19,
        "karma": 2755
    },
    {
        "body": "How long did everyone run the last gen chips? Expansion yes but replacement even at GPU is still the same timeframe. NVIDIA isn’t dropping new data center GPUs every quarter. Quick glance it looks like 2-3 years. How much of what NVIDIA can produce is already bought and earmarked? Last I heard they just cut the delivery times to 3-4 months.",
        "created_utc": "2024-05-21 15:26:28",
        "score": 4,
        "karma": 4971
    },
    {
        "body": "5x just from the dollar halving. So 1T of today’s money is a lot in a decade. \n\nTop company 2008 was 500B , 2018 1T, 2024 3.2T, 2035 ____ \n\nPretty sure if Nvidia is the top company in the USA the next decade it ll have some incredible run. Just from the dollar going in half. Like it does every decade",
        "created_utc": "2024-05-21 17:50:51",
        "score": 23,
        "karma": 2755
    },
    {
        "body": "Worth more than fucking ASML, NVIDIA, and TSMC combined, and for what? A godamn burrito",
        "created_utc": "2024-05-21 15:52:51",
        "score": 1,
        "karma": 4148
    },
    {
        "body": "I don’t like pretending $NVDA is not going to moon just do it already ![img](emote|t5_2th52|27421)",
        "created_utc": "2024-05-21 14:06:38",
        "score": 14,
        "karma": 14420
    },
    {
        "body": "Whyyyy Nvidia![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)![img](emote|t5_2th52|27421)",
        "created_utc": "2024-05-21 13:18:48",
        "score": 9,
        "karma": 7293
    },
    {
        "body": "Nvidia about to fly",
        "created_utc": "2024-05-21 13:31:38",
        "score": 10,
        "karma": 689
    },
    {
        "body": "Did jensen say the n word",
        "created_utc": "2024-05-21 13:21:42",
        "score": 7,
        "karma": 228
    },
    {
        "body": "I hope Jensen makes absurd announcements during earnings. \"Behold, NVDA invented the question mark and own all rights to its use\".",
        "created_utc": "2024-05-21 17:48:07",
        "score": 7,
        "karma": 4327
    },
    {
        "body": "Nvidia top is in: Amazon halts orders of H1000 chips in favour for the upcoming chips.",
        "created_utc": "2024-05-21 13:24:12",
        "score": 6,
        "karma": 19420
    },
    {
        "body": "Not sure why nvidia would race over 1K this earnings lol. Just had two massive moves up prior earnings",
        "created_utc": "2024-05-21 13:27:27",
        "score": 5,
        "karma": 9330
    },
    {
        "body": "Not even Amazon halting Nvidia buys can keep NVDA red. $975 here we come before final rugpull.",
        "created_utc": "2024-05-21 14:43:21",
        "score": 6,
        "karma": 21978
    },
    {
        "body": "i think op wants us to ignore nvidia bc premiums for earnings on both ends are not worth the risk",
        "created_utc": "2024-05-21 05:31:27",
        "score": 4,
        "karma": 361
    },
    {
        "body": "[https://www.reddit.com/r/UkrainianConflict/comments/1cwz9tg/nvidia\\_the\\_largest\\_us\\_it\\_company\\_continues\\_to/](https://www.reddit.com/r/UkrainianConflict/comments/1cwz9tg/nvidia_the_largest_us_it_company_continues_to/)\n\n[https://news.online.ua/en/alabugaleaks-russian-drone-manufacter-cooperates-with-western-companies-878781/](https://news.online.ua/en/alabugaleaks-russian-drone-manufacter-cooperates-with-western-companies-878781/)\n\n  \n\"Albatross\" uses Nvidia Jetson series microcomputers for neural network-based pattern recognition.\n\nCommunication and cooperation with Nvidia have been going on since at least 2016.",
        "created_utc": "2024-05-21 11:03:48",
        "score": 2,
        "karma": 3047
    },
    {
        "body": "The board should threaten to fire him for violating his fiduciary obligation to the share holders. The stock will tank, but it will tank anyway. They could just as easily sky rocket again by making a deal with nvidia or Microsoft.",
        "created_utc": "2024-05-21 11:14:15",
        "score": 1,
        "karma": 47479
    },
    {
        "body": "What leveraged nvidia product is this?",
        "created_utc": "2024-05-21 02:17:20",
        "score": 1,
        "karma": 470
    },
    {
        "body": "Any guesses on how many black jackets Jensen actually owns?",
        "created_utc": "2024-05-21 01:01:36",
        "score": 4,
        "karma": 3788
    },
    {
        "body": "Then why did Google spend 20% more in the first quarter on ai infrastructure than they originally earmarked?\n\nWhy is Amazon going to “meaningfully” increase spending on ai infrastructure?\n\nWhy has meta put itself on pace to buy 1.5 million nvidia chips this year?\n\nWhy is Microsoft going to spend $100 billion on a supercomputer over the next four years on top of tripling their h100 count this year?",
        "created_utc": "2024-05-21 03:19:22",
        "score": 8,
        "karma": 29507
    },
    {
        "body": "Nvidia earnings got me scared to make a move anywhere",
        "created_utc": "2024-05-21 04:51:29",
        "score": 2,
        "karma": 124
    }
]
