[
    {
        "body": "Mods where is my flair for the Jensen Huang post ![img](emote|t5_2th52|4260)",
        "created_utc": "2024-05-26 20:05:29",
        "score": 5,
        "karma": 4706
    },
    {
        "body": "I have to say I raised cash last week. The huge bearish engulfing after NVIDIA earnings needs to be negated first. Even if we go higher another 3 months we will eventually drop.",
        "created_utc": "2024-05-26 20:07:00",
        "score": 1,
        "karma": 20060
    },
    {
        "body": "$MSFT is out in front of $GOOG, but probably not as far as people think.  They are just doing a better job communicating to investors.\n\n$NVDA is just kicking ass, winning the first phase of AI, which is the infrastructure build out.  \n\nEventually, the infrastructure phase will top out, and it will be more about applications.....",
        "created_utc": "2024-05-26 16:42:07",
        "score": 13,
        "karma": 913
    },
    {
        "body": "orcl also has a partnership with nvda.\n\nintc timeline to profitability is for ifs.  other business divisions are still generating revenues and earnings.\n\nwhen huang said tsla's fsd is leading the adas race, i'm sure a lot of owners of tsla and people in the adas industry cringed at that remark.",
        "created_utc": "2024-05-26 19:10:13",
        "score": 1,
        "karma": 1539
    },
    {
        "body": ">$NVDA is just kicking ass,\n\nI mean have you seen the jacket? I like the cut of his jib.",
        "created_utc": "2024-05-26 17:09:53",
        "score": 5,
        "karma": 41308
    },
    {
        "body": "I'll be having a *Brownian motion* of my own of Nvidia keeps running.",
        "created_utc": "2024-05-26 14:23:55",
        "score": 1,
        "karma": 41308
    },
    {
        "body": "Jensen and Elon are the Francis Fukuyama's of tech.",
        "created_utc": "2024-05-26 17:34:05",
        "score": 1,
        "karma": 1661
    },
    {
        "body": "Currently on Microsft, Alphabet and Apple. Sold NVIDIA too early.\n\nWill adjust portfolio to AI advancements and diversify from there on.",
        "created_utc": "2024-05-26 16:11:52",
        "score": 13,
        "karma": 2121
    },
    {
        "body": "I just don't get it. Why amc?\n\nThere's Nvidia. There's AMD. Msft. Apple. So many super great companies. But amc? The thing that squeezed 3 years ago?!",
        "created_utc": "2024-05-26 17:07:48",
        "score": 1,
        "karma": 28343
    },
    {
        "body": "Nvidia might be expensive but they make the best GPUs. AMD tried to keep up but even 20+ years later Nvidia is still king of GPUs. It’s not just about AI.",
        "created_utc": "2024-05-26 13:48:59",
        "score": 4,
        "karma": 17148
    },
    {
        "body": "NVIDIA, the powerhouse of computational prowess. The world bows to their might.",
        "created_utc": "2024-05-26 12:03:05",
        "score": 4,
        "karma": 1209038
    },
    {
        "body": "Imagine Nvidia purchasing fighter jets, Sams and other defence gizmo lol",
        "created_utc": "2024-05-26 16:55:46",
        "score": 5,
        "karma": 6170
    },
    {
        "body": "Nvidia would drop 10%, which is the same amount China spends annually on their military. General Huang would fuck them up",
        "created_utc": "2024-05-26 17:23:59",
        "score": 3,
        "karma": 9422
    },
    {
        "body": "Sell $NVDA, wait for news, reinvest in $NVDA at a discount. Cash preserved. \n\nLots of people die, destruction all over, entire industries, markets and ecosystems break… but it’s “all priced in”. \n\nCause we are sick fucks.",
        "created_utc": "2024-05-26 15:39:05",
        "score": 2,
        "karma": 690
    },
    {
        "body": "Nvidia has a “secret” stock of chips for just in case",
        "created_utc": "2024-05-26 20:05:31",
        "score": 1,
        "karma": 1556
    },
    {
        "body": "I think OP's point is what happens if China invades Taiwan and takes control of NVIDIA's factories, potentially closing them for a certain period. The production capacity could drop to zero overnight. And since they supply chips to so many companies, those businesses would take a hit accordingly.\n\nWhat does this have anything to do with being successful or a bubble?",
        "created_utc": "2024-05-26 12:08:18",
        "score": 9,
        "karma": 1198
    },
    {
        "body": "It's not taking control of NVIDIA factories... But TSMC.   I'm pretty sure you'd see the TSMC factories obliterated in the conflict.",
        "created_utc": "2024-05-26 12:27:01",
        "score": 2,
        "karma": 40006
    },
    {
        "body": "The problem with NVIDIA is.... when do you sell?",
        "created_utc": "2024-05-26 17:11:44",
        "score": 22,
        "karma": 3906
    },
    {
        "body": "Don’t you think the 3 year prospects for AMD are better than the 3 year prospects of NVIDIA? I mean, they are both good but imagining NVDA at 10x here is unbelievable, but AMD 10x here is possible.",
        "created_utc": "2024-05-26 13:05:13",
        "score": 19,
        "karma": 380
    },
    {
        "body": "I always feel like when a super popular stock splits, it’s takes forever to go up after that. Tesla, Amazon, google, Apple. When Nvidia split last time, nobody really cared cause they wanted the Tesla split. Nobody thought Nvidia was gonna go up very much.",
        "created_utc": "2024-05-26 19:33:28",
        "score": 1,
        "karma": 9191
    },
    {
        "body": "difference is Nvidia has an actual product while Tesla is nothing but Elon's bullshit, and him being exposed as an incompetent right wing bumblefuck has driven the stock price down and there's no recovery until he's gone.",
        "created_utc": "2024-05-26 14:37:32",
        "score": 12,
        "karma": 1623
    },
    {
        "body": "I’ve no idea how the fluctuations will go short term, obviously. But, yes, *if planning to hold three years or more,* my answer is still: buy when you can (assuming other investments and etc)\n\nTiming the market is an errand I’d not undertake. (Well, on buying shares in Nvidia, anyway.)",
        "created_utc": "2024-05-26 09:17:59",
        "score": 9,
        "karma": 5096
    },
    {
        "body": "Imagine thinking boomers don’t already own fuck tons of Nvidia.",
        "created_utc": "2024-05-26 10:55:25",
        "score": 2,
        "karma": 1706
    },
    {
        "body": "My 401k is heavy on a fidelity growth fund which had about 3/4% of Nvidia last year, it's now 16% of it. Definitely enjoyed the ride without much risk.\n\nYou don't always need to be a regard to make good money.",
        "created_utc": "2024-05-26 16:06:28",
        "score": 19,
        "karma": 26424
    },
    {
        "body": "Investors who hold Nvidia stock after market close on June 6 will receive nine additional shares per share owned after market close on June 7, with prices of those shares likewise splitting on a 10-to-one basis. Trading on the split basis will begin June 10.",
        "created_utc": "2024-05-26 10:54:50",
        "score": 12,
        "karma": 178
    },
    {
        "body": "NVIDIA, ASML, Microsoft, AMD and Intel. Every empire needs its emperor.",
        "created_utc": "2024-05-26 03:54:01",
        "score": 21,
        "karma": 1209055
    },
    {
        "body": "Can somebody explain why HPE didnt make the list? \n\nThey have Hardware, Software and NVIDIA partnership?",
        "created_utc": "2024-05-26 07:49:27",
        "score": 7,
        "karma": 5537
    },
    {
        "body": "check out that Nvidia stock!",
        "created_utc": "2024-05-26 15:59:33",
        "score": 1,
        "karma": 304
    }
]